# SOURCE: https://github.com/webpro/dotfiles/blob/master/install/Brewfile
# The most basic Brewfile required to get this dotfile repo going

tap "goles/battery"
tap "homebrew/bundle"
tap "homebrew/core"

# brew "bats"
# brew "coreutils"
# brew "diff-so-fancy"
# brew "dockutil"
# brew "fasd"
# # brew "ffmpeg"
# # brew "gnu-sed", args: ["with-default-names"]
# brew "goles/battery/battery"
# # brew "grep", args: ["--with-default-names"]
# brew "grip"
# brew "httpie"
# # brew "imagemagick"
# brew "jq"
# # brew "lynx"
# brew "mackup"
# # brew "nano"
# brew "pandoc"
# brew "peco"
# brew "psgrep"
# brew "python"
# brew "python@2"
# brew "shellcheck"
# brew "ssh-copy-id"
# brew "tree"

brew "libffi"
brew "openssl"
brew "libyaml"
brew "python2"
brew "nvm"
brew "nodejs"
brew "rbenv"
brew "ruby-build"
brew "readline"
brew "tree"
brew "coreutils"
brew "bats"
brew "bash-completion2"
brew "moreutils"
brew "findutils"
brew "tmux"
brew "fzf"
brew "hub"
brew "jq"
brew "libffi"
brew "stow"
